{
  "word2idx": {
    "<pad>": 0,
    "<sos>": 1,
    "<eos>": 2,
    "!": 3,
    "(": 4,
    ")": 5,
    "+": 6,
    ",": 7,
    "-": 8,
    ".": 9,
    "/": 10,
    "0": 11,
    "1": 12,
    "2": 13,
    "3": 14,
    "4": 15,
    "5": 16,
    "6": 17,
    "7": 18,
    "8": 19,
    "9": 20,
    "<": 21,
    "=": 22,
    ">": 23,
    "A": 24,
    "B": 25,
    "C": 26,
    "E": 27,
    "F": 28,
    "G": 29,
    "H": 30,
    "I": 31,
    "L": 32,
    "M": 33,
    "N": 34,
    "P": 35,
    "R": 36,
    "S": 37,
    "T": 38,
    "V": 39,
    "X": 40,
    "Y": 41,
    "[": 42,
    "\\Delta": 43,
    "\\Pi": 44,
    "\\alpha": 45,
    "\\beta": 46,
    "\\cdot": 47,
    "\\cdots": 48,
    "\\cos": 49,
    "\\div": 50,
    "\\exists": 51,
    "\\forall": 52,
    "\\frac": 53,
    "\\gamma": 54,
    "\\geq": 55,
    "\\in": 56,
    "\\infty": 57,
    "\\int": 58,
    "\\lambda": 59,
    "\\ldots": 60,
    "\\leq": 61,
    "\\lim": 62,
    "\\limits": 63,
    "\\log": 64,
    "\\mu": 65,
    "\\neq": 66,
    "\\phi": 67,
    "\\pi": 68,
    "\\pm": 69,
    "\\prime": 70,
    "\\rightarrow": 71,
    "\\sigma": 72,
    "\\sin": 73,
    "\\sqrt": 74,
    "\\sum": 75,
    "\\tan": 76,
    "\\theta": 77,
    "\\times": 78,
    "\\{": 79,
    "\\}": 80,
    "]": 81,
    "^": 82,
    "_": 83,
    "a": 84,
    "b": 85,
    "c": 86,
    "d": 87,
    "e": 88,
    "f": 89,
    "g": 90,
    "h": 91,
    "i": 92,
    "j": 93,
    "k": 94,
    "l": 95,
    "m": 96,
    "n": 97,
    "o": 98,
    "p": 99,
    "q": 100,
    "r": 101,
    "s": 102,
    "t": 103,
    "u": 104,
    "v": 105,
    "w": 106,
    "x": 107,
    "y": 108,
    "z": 109,
    "{": 110,
    "|": 111,
    "}": 112
  },
  "idx2word": {
    "0": "<pad>",
    "1": "<sos>",
    "2": "<eos>",
    "3": "!",
    "4": "(",
    "5": ")",
    "6": "+",
    "7": ",",
    "8": "-",
    "9": ".",
    "10": "/",
    "11": "0",
    "12": "1",
    "13": "2",
    "14": "3",
    "15": "4",
    "16": "5",
    "17": "6",
    "18": "7",
    "19": "8",
    "20": "9",
    "21": "<",
    "22": "=",
    "23": ">",
    "24": "A",
    "25": "B",
    "26": "C",
    "27": "E",
    "28": "F",
    "29": "G",
    "30": "H",
    "31": "I",
    "32": "L",
    "33": "M",
    "34": "N",
    "35": "P",
    "36": "R",
    "37": "S",
    "38": "T",
    "39": "V",
    "40": "X",
    "41": "Y",
    "42": "[",
    "43": "\\Delta",
    "44": "\\Pi",
    "45": "\\alpha",
    "46": "\\beta",
    "47": "\\cdot",
    "48": "\\cdots",
    "49": "\\cos",
    "50": "\\div",
    "51": "\\exists",
    "52": "\\forall",
    "53": "\\frac",
    "54": "\\gamma",
    "55": "\\geq",
    "56": "\\in",
    "57": "\\infty",
    "58": "\\int",
    "59": "\\lambda",
    "60": "\\ldots",
    "61": "\\leq",
    "62": "\\lim",
    "63": "\\limits",
    "64": "\\log",
    "65": "\\mu",
    "66": "\\neq",
    "67": "\\phi",
    "68": "\\pi",
    "69": "\\pm",
    "70": "\\prime",
    "71": "\\rightarrow",
    "72": "\\sigma",
    "73": "\\sin",
    "74": "\\sqrt",
    "75": "\\sum",
    "76": "\\tan",
    "77": "\\theta",
    "78": "\\times",
    "79": "\\{",
    "80": "\\}",
    "81": "]",
    "82": "^",
    "83": "_",
    "84": "a",
    "85": "b",
    "86": "c",
    "87": "d",
    "88": "e",
    "89": "f",
    "90": "g",
    "91": "h",
    "92": "i",
    "93": "j",
    "94": "k",
    "95": "l",
    "96": "m",
    "97": "n",
    "98": "o",
    "99": "p",
    "100": "q",
    "101": "r",
    "102": "s",
    "103": "t",
    "104": "u",
    "105": "v",
    "106": "w",
    "107": "x",
    "108": "y",
    "109": "z",
    "110": "{",
    "111": "|",
    "112": "}"
  },
  "special_tokens": {
    "pad": 0,
    "sos": 1,
    "eos": 2
  },
  "vocab_size": 113
}